Documents/ПриёмНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ПриёмНаРаботу</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидТарифнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриёмНаРаботу/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Печать(Команда)
	Табдок = ПечатьСерв();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция ПечатьСерв()
	ТабДок = Новый ТабличныйДокумент;
	//обь = РеквизитФормыВЗначение("Объект");
	Макет= Документы.ПриёмНаРаботу.ПолучитьМакет("Макет");
	
	ОблДок = Макет.ПолучитьОбласть("ОбластьДок");
	
	ОблДок.Параметры.Автосалон ="Автосалон";
	
	
	ОблДок.Параметры.Подразделение = Строка(Объект.Подразделение);
	ОблДок.Параметры.ТН = Строка(Объект.Номер);
	ОблДок.Параметры.ФИО = Строка(Объект.Сотрудник);
	ОблДок.Параметры.дата = Строка(Объект.Дата);
	ОблДок.Параметры.должность = Строка(Объект.Должность);
	ОблДок.Параметры.номер = Строка(Объект.Номер);
	ОблДок.Параметры.оклад = Строка(Объект.ТарифнаяСтавка);
	ОблДок.Параметры.условия = Строка(Объект.ВидТарифнойСтавки);
	ТабДок.Вывести(ОблДок);
	//Макет.Вывести();
	
	Возврат  ТабДок;
КонецФункции
